*** Settings ***
Documentation  Planning test suite
Library  SeleniumLibrary
Resource      ../Resource/base_keywords.robot
Suite Setup  Залогуватись як Замовник
#Suite Teardown  Close all browsers

*** Variables ***



*** Test Cases ***
Створення та публікація рядку плану закупівлі
    #Натиснути "Створити рядок плану закупівлі"
    #Заповнити обов'язкові поля плану:
    #Заповнити поле тип процедури
    #Дочекатися результатів пошуку
    #Заповнити поле Рік
    #Дочекатися результатів пошуку
    #Заповнити поле Конкретна назва предмета закупівлі
    #Дочекатися результатів пошуку
    #Заповнити поле коди та назви відповідних класифікаторів предмета закупівлі з переліку
    #Дочекатися результатів пошуку
    #Заповнити поле "Розмір бюджетного призначення за кошторисом або очікувана вартість предмета закупівлі"
    #Дочекатися результатів пошуку
    #Обрати відповідне значення з переліку Валюта
    #Дочекатися результатів пошуку
    #Вказати "Орієнтовний початок процедури закупівлі"
    #Дочекатися результатів пошуку
    #Додати документ(ти) до плану
    #Замінити документ (ти) до плану
    #Натиснути "Зберегти як чернетку"
    "Опублікувати" рядок плану закупівлі




